In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv(r"E:\PYTHON\Project-2\customer_details.csv")

In [3]:
df1

               0       1     2    3     4    5          6    7
0            1.0    Male  44.0  1.0  28.0  0.0  > 2 Years  Yes
1            2.0    Male  76.0  1.0   3.0  0.0   1-2 Year   No
2            3.0    Male  47.0  1.0  28.0  0.0  > 2 Years  Yes
3            4.0    Male  21.0  1.0  11.0  1.0   < 1 Year   No
4            5.0  Female  29.0  1.0  41.0  1.0   < 1 Year   No
...          ...     ...   ...  ...   ...  ...        ...  ...
381104  381105.0    Male  74.0  1.0  26.0  1.0   1-2 Year   No
381105  381106.0    Male  30.0  1.0  37.0  1.0   < 1 Year   No
381106  381107.0    Male  21.0  1.0  30.0  1.0   < 1 Year   No
381107  381108.0  Female  68.0  1.0  14.0  0.0  > 2 Years  Yes
381108  381109.0    Male  46.0  1.0  29.0  0.0   1-2 Year   No

[381109 rows x 8 columns]

In [5]:
df2 = pd.read_csv(r"E:\PYTHON\Project-2\customer_policy_details.csv")

In [6]:
df2

               0        1      2      3    4
0            1.0  40454.0   26.0  217.0  1.0
1            2.0  33536.0   26.0  183.0  0.0
2            3.0  38294.0   26.0   27.0  1.0
3            4.0  28619.0  152.0  203.0  0.0
4            5.0  27496.0  152.0   39.0  0.0
...          ...      ...    ...    ...  ...
381104  381105.0  30170.0   26.0   88.0  0.0
381105  381106.0  40016.0  152.0  131.0  0.0
381106  381107.0  35118.0  160.0  161.0  0.0
381107  381108.0  44617.0  124.0   74.0  0.0
381108  381109.0  41777.0   26.0  237.0  0.0

[381109 rows x 5 columns]

## 1Q. Add the column names to both datasets:

In [7]:
# 1. Column Name for customer details table:

df1.columns = ["customer_id","Gender","age","driving licence present","region code","previously insured","vehicle age","vehicle damage"]

In [8]:
df1

,customer_id,Gender,age,driving licence present,region code,previously insured,vehicle age,vehicle damage
0,1.0,Male,44.0,1.0,28.0,0.0,> 2 Years,Yes
1,2.0,Male,76.0,1.0,3.0,0.0,1-2 Year,No
2,3.0,Male,47.0,1.0,28.0,0.0,> 2 Years,Yes
3,4.0,Male,21.0,1.0,11.0,1.0,< 1 Year,No
4,5.0,Female,29.0,1.0,41.0,1.0,< 1 Year,No
...,...,...,...,...,...,...,...,...
381104,381105.0,Male,74.0,1.0,26.0,1.0,1-2 Year,No
381105,381106.0,Male,30.0,1.0,37.0,1.0,< 1 Year,No
381106,381107.0,Male,21.0,1.0,30.0,1.0,< 1 Year,No
381107,381108.0,Female,68.0,1.0,14.0,0.0,> 2 Years,Yes
381108,381109.0,Male,46.0,1.0,29.0,0.0,1-2 Year,No

In [ ]:
# 1. Column Name for customer_policy table:

In [9]:
df2.columns = ["customer_id","annual premium (in Rs)","sales channel code","vintage","response"]

In [10]:
df2

,customer_id,annual premium (in Rs),sales channel code,vintage,response
0,1.0,40454.0,26.0,217.0,1.0
1,2.0,33536.0,26.0,183.0,0.0
2,3.0,38294.0,26.0,27.0,1.0
3,4.0,28619.0,152.0,203.0,0.0
4,5.0,27496.0,152.0,39.0,0.0
...,...,...,...,...,...
381104,381105.0,30170.0,26.0,88.0,0.0
381105,381106.0,40016.0,152.0,131.0,0.0
381106,381107.0,35118.0,160.0,161.0,0.0
381107,381108.0,44617.0,124.0,74.0,0.0
381108,381109.0,41777.0,26.0,237.0,0.0

## 2Q. Checking and Cleaning Data Quality:

### 1. Null values

In [12]:
# 1.Generate a summary of count of all the null values column wise

# customer_details dataset(df1)

df1.isnull().sum()

customer_id                386
Gender                     368
age                        368
driving licence present    393
region code                392
previously insured         381
vehicle age                381
vehicle damage             407
dtype: int64

In [13]:
# 2.Drop Null values for customer_id because central tendencies for idâ€™s is not feasible.

# customer_details dataset(df1)

df1.dropna(subset = ["customer_id"],inplace = True)

In [14]:
df1.isnull().sum()

customer_id                  0
Gender                     368
age                        366
driving licence present    392
region code                391
previously insured         381
vehicle age                381
vehicle damage             406
dtype: int64

In [15]:
# 3.Replace all null values for numeric columns by mean. 

# customer_details dataset(df1).

# 'age','region code' columns contain numerical data and remaining columns contain categorical data.

df1["age"].fillna(df1["age"].mean(),inplace = True)

In [16]:
df1.isnull().sum()

customer_id                  0
Gender                     368
age                          0
driving licence present    392
region code                391
previously insured         381
vehicle age                381
vehicle damage             406
dtype: int64

In [17]:
df1["region code"].fillna(df1["region code"].mean(),inplace = True)

In [18]:
df1.isnull().sum()

customer_id                  0
Gender                     368
age                          0
driving licence present    392
region code                  0
previously insured         381
vehicle age                381
vehicle damage             406
dtype: int64

In [22]:
# 4.Replace all null values for Categorical value by mode.

# customer_details dataset(df1)

df1["Gender"].fillna(df1["Gender"].mode()[0],inplace = True)

In [23]:
df1.isnull().sum()

customer_id                  0
Gender                       0
age                          0
driving licence present    392
region code                  0
previously insured         381
vehicle age                381
vehicle damage             406
dtype: int64

In [24]:
df1["driving licence present"].fillna(df1["driving licence present"].mode()[0],inplace = True)

In [25]:
df1.isnull().sum()

customer_id                  0
Gender                       0
age                          0
driving licence present      0
region code                  0
previously insured         381
vehicle age                381
vehicle damage             406
dtype: int64

In [26]:
df1["previously insured"].fillna(df1["previously insured"].mode()[0],inplace = True)

In [27]:
df1.isnull().sum()

customer_id                  0
Gender                       0
age                          0
driving licence present      0
region code                  0
previously insured           0
vehicle age                381
vehicle damage             406
dtype: int64

In [28]:
df1["vehicle age"].fillna(df1["vehicle age"].mode()[0],inplace = True)

In [29]:
df1.isnull().sum()

customer_id                  0
Gender                       0
age                          0
driving licence present      0
region code                  0
previously insured           0
vehicle age                  0
vehicle damage             406
dtype: int64

In [30]:
df1["vehicle damage"].fillna(df1["vehicle damage"].mode()[0],inplace = True)

In [31]:
df1.isnull().sum()

customer_id                0
Gender                     0
age                        0
driving licence present    0
region code                0
previously insured         0
vehicle age                0
vehicle damage             0
dtype: int64

In [33]:
# 1.Generate a summary of count of all the null values column wise

# for customer_policy_details(df2)

df2.isnull().sum()

customer_id               387
annual premium (in Rs)    346
sales channel code        400
vintage                   388
response                  361
dtype: int64

In [34]:
# 2.Drop Null values for customer_id because central tendencies for idâ€™s is not feasible.

# for customer_policy_details(df2)

df2.dropna(subset = ["customer_id"],inplace = True)

In [35]:
df2.isnull().sum()

customer_id                 0
annual premium (in Rs)    344
sales channel code        400
vintage                   388
response                  361
dtype: int64

In [38]:
# 3.Replace all null values for numeric columns by mean. 

# for customer_policy_details(df2).

# 'annual premium (in Rs)','sales channel code','vintage' columns contain numerical data and remaining columns contain categorical data.

df2["annual premium (in Rs)"].fillna(df2["annual premium (in Rs)"].mean(),inplace = True)

In [39]:
df2.isnull().sum()

customer_id                 0
annual premium (in Rs)      0
sales channel code        400
vintage                   388
response                  361
dtype: int64

In [40]:
df2["sales channel code"].fillna(df2["sales channel code"].mean(),inplace = True)

In [41]:
df2.isnull().sum()

customer_id                 0
annual premium (in Rs)      0
sales channel code          0
vintage                   388
response                  361
dtype: int64

In [42]:
df2["vintage"].fillna(df2["vintage"].mean(),inplace = True)

In [43]:
df2.isnull().sum()

customer_id                 0
annual premium (in Rs)      0
sales channel code          0
vintage                     0
response                  361
dtype: int64

In [44]:
# 4.Replace all null values for Categorical value by mode.

# for customer_policy_details(df2).

# only 'responce' is the categorical column

df2["response"].fillna(df2["response"].mode()[0],inplace = True)

In [45]:
df2.isnull().sum()

customer_id               0
annual premium (in Rs)    0
sales channel code        0
vintage                   0
response                  0
dtype: int64

## 2. Outliers

In [46]:
# 1.Generate a summary of count of all the outliers column wise

# customer_details dataset(df1).

df1.describe()

,customer_id,age,driving licence present,region code,previously insured
count,380723.000000,380723.000000,380723.000000,380723.000000,380723.000000
mean,190548.776244,38.822788,0.997870,26.389436,0.457800
std,110016.805160,15.504826,0.046105,13.223671,0.498217
min,1.000000,20.000000,0.000000,0.000000,0.000000
25%,95269.500000,25.000000,1.000000,15.000000,0.000000
50%,190543.000000,36.000000,1.000000,28.000000,0.000000
75%,285822.500000,49.000000,1.000000,35.000000,1.000000
max,381109.000000,85.000000,1.000000,52.000000,1.000000

In [49]:
Q1 = df1.quantile(0.25)
Q3 = df1.quantile(0.75)

In [50]:
IQR = Q3 - Q1

In [51]:
((df1 <(Q1 - 1.5*IQR)) | (df1 >(Q3 + 1.5*IQR))).sum()

C:\Users\91953\AppData\Local\Temp\ipykernel_4972\3113731443.py:1: FutureWarning: Automatic reindexing on DataFrame vs Series comparisons is deprecated and will raise ValueError in a future version. Do `left, right = left.align(right, axis=1, copy=False)` before e.g. `left == right`
  ((df1 <(Q1 - 1.5*IQR)) | (df1 >(Q3 + 1.5*IQR))).sum()

Gender                       0
age                          0
customer_id                  0
driving licence present    811
previously insured           0
region code                  0
vehicle age                  0
vehicle damage               0
dtype: int64

In [58]:
# for customer_details dataset(df1)
# From above table we can conclude that no outliers for numeric columns('age','region code') 
# only 'driving licence present' column have outliers but it is categorical column

In [53]:
# for customer_policy_details(df2).

df2.describe()

,customer_id,annual premium (in Rs),sales channel code,vintage,response
count,380722.000000,380722.000000,380722.000000,380722.000000,380722.000000
mean,190547.491663,30563.999774,112.036687,154.347192,0.122410
std,110013.824148,17190.147550,54.177046,83.628096,0.327759
min,1.000000,2630.000000,1.000000,10.000000,0.000000
25%,95276.250000,24416.000000,29.000000,82.000000,0.000000
50%,190536.500000,31656.000000,131.000000,154.000000,0.000000
75%,285818.750000,39391.750000,152.000000,227.000000,0.000000
max,381109.000000,540165.000000,163.000000,299.000000,1.000000

In [54]:
Q1 = df2.quantile(0.25)
Q3 = df2.quantile(0.75)

In [55]:
IQR = Q3 - Q1

In [56]:
((df2 <(Q1 - 1.5*IQR)) | (df2 >(Q3 + 1.5*IQR))).sum()

customer_id                   0
annual premium (in Rs)    10332
sales channel code            0
vintage                       0
response                  46604
dtype: int64

In [61]:
# for customer_policy_details(df2)
# From above table we can conclude that outliers are present only for 'annual premium (in Rs)' column
# even 'response' column contain outliers but is categorical column.

In [62]:
# 2.Replace all outlier values for numeric columns by mean.

# No need to replace outlier values for numeric columns by mean for customer_details dataset(df1) as no outliers for numerical column 

# outliers are present in customer_policy_details(df2) column 'annual premium (in Rs)'

In [63]:
Q1 = df2['annual premium (in Rs)'].quantile(0.25)
Q3 = df2['annual premium (in Rs)'].quantile(0.75)

In [71]:
Q1

24416.0

In [73]:
Q3

39391.75

In [74]:
IQR = Q3 - Q1

In [75]:
IQR

14975.75

In [78]:
Lower = Q1 - 1.5*IQR
print(Lower)
Upper = Q3 + 1.5*IQR
print(Upper)

1952.375
61855.375

In [80]:
((df2[["annual premium (in Rs)"]]<Lower) | (df2[["annual premium (in Rs)"]]>Upper)).sum()

annual premium (in Rs)    10332
dtype: int64

In [82]:
Row_count = ((df2[["annual premium (in Rs)"]]<Lower) | (df2[["annual premium (in Rs)"]]>Upper))

In [84]:
Row_count_index = Row_count[Row_count["annual premium (in Rs)"]].index

In [85]:
Row_count_index

Int64Index([    25,     37,     67,    139,    149,    167,    176,    216,
               310,    315,
            ...
            380655, 380733, 380761, 380815, 380860, 380959, 380998, 381035,
            381047, 381079],
           dtype='int64', length=10332)

In [86]:
df2.loc[Row_count_index,"annual premium (in Rs)"] = df2["annual premium (in Rs)"].mean()

In [87]:
((df2[["annual premium (in Rs)"]]<Lower) | (df2[["annual premium (in Rs)"]]>Upper)).sum()

annual premium (in Rs)    0
dtype: int64

### 3. White spaces

In [88]:
# Remove white spaces

df1['Gender'].str.strip()

0           Male
1           Male
2           Male
3           Male
4         Female
           ...
381104      Male
381105      Male
381106      Male
381107    Female
381108      Male
Name: Gender, Length: 380723, dtype: object

In [89]:
# In dataset df1 except 'Gender' column remaing columns are float values and in df2 dataset all columns are float values so no need to remove white spaces

### 4. Case correction(lower or upper, any one)

In [90]:
df1.apply(lambda x: x.str.upper() if x.dtype=='object' else x)

,customer_id,Gender,age,driving licence present,region code,previously insured,vehicle age,vehicle damage
0,1.0,MALE,44.0,1.0,28.0,0.0,> 2 YEARS,YES
1,2.0,MALE,76.0,1.0,3.0,0.0,1-2 YEAR,NO
2,3.0,MALE,47.0,1.0,28.0,0.0,> 2 YEARS,YES
3,4.0,MALE,21.0,1.0,11.0,1.0,< 1 YEAR,NO
4,5.0,FEMALE,29.0,1.0,41.0,1.0,< 1 YEAR,NO
...,...,...,...,...,...,...,...,...
381104,381105.0,MALE,74.0,1.0,26.0,1.0,1-2 YEAR,NO
381105,381106.0,MALE,30.0,1.0,37.0,1.0,< 1 YEAR,NO
381106,381107.0,MALE,21.0,1.0,30.0,1.0,< 1 YEAR,NO
381107,381108.0,FEMALE,68.0,1.0,14.0,0.0,> 2 YEARS,YES
381108,381109.0,MALE,46.0,1.0,29.0,0.0,1-2 YEAR,NO

### 5.Convert nominal data (categorical) into dummies

In [92]:
dummy_variable_1 = pd.get_dummies(df1['vehicle damage'])

In [93]:
dummy_variable_1.head()

   No  Yes
0   0    1
1   1    0
2   0    1
3   1    0
4   1    0

In [94]:
dummy_variable_1.rename(columns = {'No':'vehicle damage_No','Yes':'vehicle damage_yes'},inplace = True)

In [95]:
dummy_variable_1.head()

   vehicle damage_No  vehicle damage_yes
0                  0                   1
1                  1                   0
2                  0                   1
3                  1                   0
4                  1                   0

In [96]:
df1 = pd.concat([df1,dummy_variable_1],axis = 1)

In [97]:
df1

,customer_id,Gender,age,driving licence present,region code,previously insured,vehicle age,vehicle damage,vehicle damage_No,vehicle damage_yes
0,1.0,Male,44.0,1.0,28.0,0.0,> 2 Years,Yes,0,1
1,2.0,Male,76.0,1.0,3.0,0.0,1-2 Year,No,1,0
2,3.0,Male,47.0,1.0,28.0,0.0,> 2 Years,Yes,0,1
3,4.0,Male,21.0,1.0,11.0,1.0,< 1 Year,No,1,0
4,5.0,Female,29.0,1.0,41.0,1.0,< 1 Year,No,1,0
...,...,...,...,...,...,...,...,...,...,...
381104,381105.0,Male,74.0,1.0,26.0,1.0,1-2 Year,No,1,0
381105,381106.0,Male,30.0,1.0,37.0,1.0,< 1 Year,No,1,0
381106,381107.0,Male,21.0,1.0,30.0,1.0,< 1 Year,No,1,0
381107,381108.0,Female,68.0,1.0,14.0,0.0,> 2 Years,Yes,0,1
381108,381109.0,Male,46.0,1.0,29.0,0.0,1-2 Year,No,1,0

In [98]:
df1.drop('vehicle damage',axis = 1,inplace = True)

In [99]:
df1

,customer_id,Gender,age,driving licence present,region code,previously insured,vehicle age,vehicle damage_No,vehicle damage_yes
0,1.0,Male,44.0,1.0,28.0,0.0,> 2 Years,0,1
1,2.0,Male,76.0,1.0,3.0,0.0,1-2 Year,1,0
2,3.0,Male,47.0,1.0,28.0,0.0,> 2 Years,0,1
3,4.0,Male,21.0,1.0,11.0,1.0,< 1 Year,1,0
4,5.0,Female,29.0,1.0,41.0,1.0,< 1 Year,1,0
...,...,...,...,...,...,...,...,...,...
381104,381105.0,Male,74.0,1.0,26.0,1.0,1-2 Year,1,0
381105,381106.0,Male,30.0,1.0,37.0,1.0,< 1 Year,1,0
381106,381107.0,Male,21.0,1.0,30.0,1.0,< 1 Year,1,0
381107,381108.0,Female,68.0,1.0,14.0,0.0,> 2 Years,0,1
381108,381109.0,Male,46.0,1.0,29.0,0.0,1-2 Year,1,0

### 6.Drop Duplicates (duplicated rows)

In [100]:
# Dropping duplicates from customer details table(df1)


df1.drop_duplicates(inplace=True)

In [102]:
# Dropping duplicates from customer policy details table(df2)

df2.drop_duplicates(inplace=True)

## 3Q.Create a Master table for future use. Join the customer table and customer_policy table to get a master table using customer_id in both tables

In [103]:
master_table = pd.merge(df1,df2,on = 'customer_id')

In [104]:
master_table

,customer_id,Gender,age,driving licence present,region code,previously insured,vehicle age,vehicle damage_No,vehicle damage_yes,annual premium (in Rs),sales channel code,vintage,response
0,1.0,Male,44.0,1.0,28.0,0.0,> 2 Years,0,1,40454.0,26.0,217.0,1.0
1,2.0,Male,76.0,1.0,3.0,0.0,1-2 Year,1,0,33536.0,26.0,183.0,0.0
2,3.0,Male,47.0,1.0,28.0,0.0,> 2 Years,0,1,38294.0,26.0,27.0,1.0
3,4.0,Male,21.0,1.0,11.0,1.0,< 1 Year,1,0,28619.0,152.0,203.0,0.0
4,5.0,Female,29.0,1.0,41.0,1.0,< 1 Year,1,0,27496.0,152.0,39.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
380331,381105.0,Male,74.0,1.0,26.0,1.0,1-2 Year,1,0,30170.0,26.0,88.0,0.0
380332,381106.0,Male,30.0,1.0,37.0,1.0,< 1 Year,1,0,40016.0,152.0,131.0,0.0
380333,381107.0,Male,21.0,1.0,30.0,1.0,< 1 Year,1,0,35118.0,160.0,161.0,0.0
380334,381108.0,Female,68.0,1.0,14.0,0.0,> 2 Years,0,1,44617.0,124.0,74.0,0.0
380335,381109.0,Male,46.0,1.0,29.0,0.0,1-2 Year,1,0,41777.0,26.0,237.0,0.0

## 4Q. Company needs some important information from the master table to make decisions for future growth.They needs following information:

### 1. Gender wise average annual premium

In [107]:
gender_data = master_table.groupby('Gender')['annual premium (in Rs)'].mean()

In [108]:
gender_data

Gender
Female    29273.474247
Male      29323.099677
Name: annual premium (in Rs), dtype: float64

### 2. Age wise average annual premium

In [110]:
age_data = master_table.groupby('age')['annual premium (in Rs)'].mean()

In [111]:
age_data

age
20.0    26342.073517
21.0    29751.791916
22.0    29946.848634
23.0    29838.344763
24.0    30125.557096
            ...
81.0    29287.910702
82.0    36480.586199
83.0    28995.818172
84.0    35440.818182
85.0    26637.454525
Name: annual premium (in Rs), Length: 67, dtype: float64

### 3.Is your data balanced between the genders?

In [112]:
master_table.groupby('Gender').count()

,customer_id,age,driving licence present,region code,previously insured,vehicle age,vehicle damage_No,vehicle damage_yes,annual premium (in Rs),sales channel code,vintage,response
Gender,,,,,,,,,,,,
Female,174485,174485,174485,174485,174485,174485,174485,174485,174485,174485,174485,174485
Male,205851,205851,205851,205851,205851,205851,205851,205851,205851,205851,205851,205851

### 4. Vehicle age wise average annual premium.

In [113]:
vehicle_age_data = master_table.groupby('vehicle age')['annual premium (in Rs)'].mean()

In [114]:
vehicle_age_data

vehicle age
1-2 Year     29102.009839
< 1 Year     29188.150594
> 2 Years    32943.540830
Name: annual premium (in Rs), dtype: float64